Public Attributes | List of all members
API_SurfaceLoadCustomData Struct Reference
Element Manager API
Describes Custom Surface Coordinates for Surface Load. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
GS::Array< API_AnalyticalCurve >  | contour
The contour as a list of Structural Analytical Model Curves.
Detailed Description
Describes Custom Surface Coordinates for Surface Load.
Since
Archicad 25
Member Data Documentation
◆ contour
 API_SurfaceLoadCustomData::contour
The contour as a list of Structural Analytical Model Curves.